const translation = {
  a: 'Пожалуйста, помоги мне!\n\nВытащи меня отсюда!\n\nПочему они не могут понять\n\nЯ схожу с ума',
  b: 'Я был ребёнком\n\nЯ должен был быть счастлив',
  c: 'Я молился и молился и молился\n\nНикто так и не ответил\n\nБоже, почему ты ненавидишь меня?\n\nГде ты был?',
  d: 'Хочу быть чистым, как ангел\nНе как демон, полный греха и грязи\n\nГосподи, помоги мне\n\nПрекрати',
  e: 'Мне было больно задолго до того, как появился ты\n\nТеперь стало в разы хуже',
  f: 'Причини мне боль\n\nИспользуй меня, пожалуйста, причини мне боль\n\nЯ не знаю, как быть любимым',
  g: 'Я социально неловкий\nЯ не знаю, как социализироваться',
  h: 'Ты видел его...\nТы видел, что он сделал...\nИ ты ничего не предпринял!!!!!',
  i: 'Грязный!\n\nЧто я вообще тебе сделал???\nЧто ты сделал со мной?\nЧто я сделал, чтобы заслужить это?\n\nСмой это\n\nВероятно, я заслужил это...',
  j: 'Теперь всё кажется пустым',
  k: 'Всё пугает\nВсё моя вина',
  l: 'Хе хе хе хе\nХа ха ха\n\nУродливое лицо\nУродливая улыбка\nУродливые дни',
  m: 'Иди нахер\n\nТы разрушил меня.\nПочему я вообще любил тебя.\n\nУбирайся',
  n: 'Жри и забудь\nЖри и притворись, что не замечаешь\n\nНям ням ням\nМоя тупая жизнь',
  o: 'Я увижу тебя в своих снах',
  p: 'Напиши мне\nМне нужно знать\nТы думаешь\nОбо\nМне\n\nЛюби меня',
  q: 'Я\n\nБесполезная\nГлупая\nСтрашная\nНехорошая\nГнилая\nЖирная\nСломанная\nНежеланная\n\nКукла',
  r: 'Голова набита ватой\n\nНет сердца\n\nТы разорвал меня на части по швам.',
  s: 'Я сломанная игрушка!',
  t: 'У меня всегда было так\n\nДаже самые счастливые мои воспоминания испорчены болью',
  u: 'Я никогда не должен был позволять тебе подобраться\n\nТак близко\nТак близко\n\nКо мне',
  v: 'Ты опять расслабился\nОни бросят тебя\n\nСмотри, что ты натворил',
  w: 'Я постоянно плачу',
  x: 'Я, блять, ненавижу тебя\nТы испоганил мне жизнь\nЯ ненавижу тебя!!!\nИди нахер\nЯ ненавижу тебя, блин\nТы всё разрушил\nХочу умереть\nНенавижу тебя',
  y: 'Я так счастлив;(',
  z: 'До сих пор интересно, кем бы я стал, если бы меня никогда не травмировало',
  aa: 'Я скорблю по детству, которого у меня никогда не было.',
  bb: 'Кажется, с моим будущим всё в порядке\n\nПосле старшей школы я: умру',
  cc: 'Что я сделал неправильно?\n\nТы уходишь?\nПожалуйста, не надо\n\nДотронься до меня',
  dd: 'Почему я не могу быть так же счастлив, как они?',
  ee: 'Почему я вечно чудик для них?',
  ff: 'Хочу, чтобы меня понимали',
  gg: 'Страшная прогнившая девочка',
  hh: 'Я разрушаю\nЯ разрушаю',
  ii: 'Они предали меня\n\nМеня унизили',
  jj: 'Не помню, какого это, - не чувствовать себя усталым и (dizzy - состояние головокружения)',
  kk: 'Почему меня оставили',
  ll: 'Почему я извиняюсь за то, что ты сделал со мной?',
  mm: 'Я не чувствую, что существую',
  nn: 'Почему это не реально?',
  oo: 'Демоны наблюдают, как я обдумываю суицид седьмой раз за сегодня',
  pp: 'Я отвратительный!!\n\nЯ ненавижу смотреть в зеркало!!\nЯ ненавижу своё лицо!!\nЯ ненавижу своё тело!!\nЯ ненавижу своё здоровье!!\nЯ ненавижу свои мысли!!\nЯ ненавижу звук своего голоса!!\nЯ ненавижу то, как я себя чувствую!!\nЯ ненавижу то, каким грязным я себя ощущаю!!\nЯ ненавижу форму своего лица!!\nЯ ненавижу все свои хобби!!\nЯ ненавижу, какой я бесталанный!!\n\nЯ не могу вынести себя!!',
  qq: 'Так громко\n\nМоя голова!\n\nСлишком громко',
  rr: 'Нет памяти только бездна\n\nЯ не помню\n\nНо тело помнит',
  ss: 'Блять',
  tt: 'Мне страшно',
  uu: 'Я поглощаю всех, кого люблю',
  vv: 'Пустая',
  ww: 'Я думал, что мне был нужен экзорцизм\n\nНо всё, в чём я нуждался, было здесь',
  xx: 'Я была всего лишь ребёнком',
  yy: 'Ненужный\n\nНежеланный\n\nБесполезный\n\nВезде',
  zz: 'Я для тебя просто кукла?',
  aaa: 'Я любил тебя\nМы оба были детьми\n\nЗабудь\n\nПочему ты сделал это со мной?',
  bbb: 'То, что ты сделал, никогда не забудется.\n\nЯ вспоминаю каждый раз, когда слышу твоё имя или вижу твоё лицо.',
  ccc: 'Мои поздравления, ты себя разрушил!',
  ddd: 'Никто не будет скучать\n\nПо тебе',
  eee: 'Они наблюдают\n\nТихо\n\nНе двигайся\nНе дыши\n\nОставайся на месте\n\nСтань невидимым',
  fff: 'Хочу, чтобы стало лучше.',
  ggg: 'Другим тяжелее\n\nТы испорченный\n\nГлупый подросток\n\nТы не заслуживаешь помощь\n\nВы правы.\nЯ просто буду наслаждаться болью.',
  hhh: 'Все хотят меня обидеть',
  iii: 'Ты опять смотрел, как я умираю.\n\nОправлюсь ли я в этот раз?',
  jjj: 'Ты что не видишь, что я просто ребёнок\n\nНе обижай меня\n\nЯ не вынесу этого',
  kkk: 'Надеюсь, я умру во сне',
  lll: 'Вскрой меня и увидишь, что мои внутренности гниют',
};

const twButton = document.querySelector('.tw button');
const main = document.querySelector('.main');
const gallery = document.querySelector('.position-3');
const shadow = document.querySelector('.shadow');
const viewer = document.querySelector('.viewer');
const closeIcon = document.querySelector('.close-icon');

function goToMain() {
  const tw = document.querySelector('.tw');
  tw.classList.add('hidden');
  main.classList.remove('hidden');
}

function showViewer(e) {
  const target = e.target;
  const id = target.id;
  const textBox = document.querySelector('.text');
  textBox.textContent = translation[id];
  shadow.classList.remove('hidden');
  viewer.classList.remove('hidden');
  console.log(translation[id]);
  console.log(target);
}

function hideViewer() {
  shadow.classList.add('hidden');
  viewer.classList.add('hidden');
}

twButton.addEventListener('click', goToMain);
gallery.addEventListener('click', showViewer);
closeIcon.addEventListener('click', hideViewer);
